In [1]:
import pandas as pd

In [2]:
df = pd.read_csv(r"economics.csv")

In [3]:
df.head()

         date    pce     pop  psavert  uempmed  unemploy
0  1967-07-01  507.4  198712     12.5      4.5      2944
1  1967-08-01  510.5  198911     12.5      4.7      2945
2  1967-09-01  516.3  199113     11.7      4.6      2958
3  1967-10-01  512.9  199311     12.5      4.9      3143
4  1967-11-01  518.1  199498     12.5      4.7      3066

In [4]:
df.tail()

           date      pce     pop  psavert  uempmed  unemploy
569  2014-12-01  12122.0  320201      5.0     12.6      8688
570  2015-01-01  12080.8  320367      5.5     13.4      8979
571  2015-02-01  12095.9  320534      5.7     13.1      8705
572  2015-03-01  12161.5  320707      5.2     12.2      8575
573  2015-04-01  12158.9  320887      5.6     11.7      8549

### Exporting Data

In [5]:
df.to_csv("clean_data.csv")

### Column Selection & Filtering

In [6]:
df['unemploy']

0      2944
1      2945
2      2958
3      3143
4      3066
       ...
569    8688
570    8979
571    8705
572    8575
573    8549
Name: unemploy, Length: 574, dtype: int64

In [7]:
df[["date","pce"]]

           date      pce
0    1967-07-01    507.4
1    1967-08-01    510.5
2    1967-09-01    516.3
3    1967-10-01    512.9
4    1967-11-01    518.1
..          ...      ...
569  2014-12-01  12122.0
570  2015-01-01  12080.8
571  2015-02-01  12095.9
572  2015-03-01  12161.5
573  2015-04-01  12158.9

[574 rows x 2 columns]

In [8]:
df[df["psavert"] < 10].head()

           date     pce     pop  psavert  uempmed  unemploy
19   1969-02-01   589.5  201881      9.4      4.9      2692
20   1969-03-01   589.7  202023      9.9      4.0      2712
21   1969-04-01   594.7  202161      9.5      4.0      2758
113  1976-12-01  1214.1  219006      9.9      8.0      7545
114  1977-01-01  1217.4  219179      9.8      7.5      7280

In [9]:
df.loc[1:4,"data":"psavert"]

         date    pce     pop  psavert
1  1967-08-01  510.5  198911     12.5
2  1967-09-01  516.3  199113     11.7
3  1967-10-01  512.9  199311     12.5
4  1967-11-01  518.1  199498     12.5

### Handling Missing Values

In [10]:
df.isna()

      date    pce    pop  psavert  uempmed  unemploy
0    False  False  False    False    False     False
1    False  False  False    False    False     False
2    False  False  False    False    False     False
3    False  False  False    False    False     False
4    False  False  False    False    False     False
..     ...    ...    ...      ...      ...       ...
569  False  False  False    False    False     False
570  False  False  False    False    False     False
571  False  False  False    False    False     False
572  False  False  False    False    False     False
573  False  False  False    False    False     False

[574 rows x 6 columns]

In [11]:
df.notna().info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 574 entries, 0 to 573
Data columns (total 6 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   date      574 non-null    bool
 1   pce       574 non-null    bool
 2   pop       574 non-null    bool
 3   psavert   574 non-null    bool
 4   uempmed   574 non-null    bool
 5   unemploy  574 non-null    bool
dtypes: bool(6)
memory usage: 3.5 KB

In [14]:
df['psavert'].notna()

0      True
1      True
2      True
3      True
4      True
       ...
569    True
570    True
571    True
572    True
573    True
Name: psavert, Length: 574, dtype: bool

In [15]:
df['date'].fillna(0)

0      1967-07-01
1      1967-08-01
2      1967-09-01
3      1967-10-01
4      1967-11-01
          ...
569    2014-12-01
570    2015-01-01
571    2015-02-01
572    2015-03-01
573    2015-04-01
Name: date, Length: 574, dtype: object

In [16]:
df.fillna(df['pce'].mean())

           date      pce     pop  psavert  uempmed  unemploy
0    1967-07-01    507.4  198712     12.5      4.5      2944
1    1967-08-01    510.5  198911     12.5      4.7      2945
2    1967-09-01    516.3  199113     11.7      4.6      2958
3    1967-10-01    512.9  199311     12.5      4.9      3143
4    1967-11-01    518.1  199498     12.5      4.7      3066
..          ...      ...     ...      ...      ...       ...
569  2014-12-01  12122.0  320201      5.0     12.6      8688
570  2015-01-01  12080.8  320367      5.5     13.4      8979
571  2015-02-01  12095.9  320534      5.7     13.1      8705
572  2015-03-01  12161.5  320707      5.2     12.2      8575
573  2015-04-01  12158.9  320887      5.6     11.7      8549

[574 rows x 6 columns]

In [17]:
df.dropna()

           date      pce     pop  psavert  uempmed  unemploy
0    1967-07-01    507.4  198712     12.5      4.5      2944
1    1967-08-01    510.5  198911     12.5      4.7      2945
2    1967-09-01    516.3  199113     11.7      4.6      2958
3    1967-10-01    512.9  199311     12.5      4.9      3143
4    1967-11-01    518.1  199498     12.5      4.7      3066
..          ...      ...     ...      ...      ...       ...
569  2014-12-01  12122.0  320201      5.0     12.6      8688
570  2015-01-01  12080.8  320367      5.5     13.4      8979
571  2015-02-01  12095.9  320534      5.7     13.1      8705
572  2015-03-01  12161.5  320707      5.2     12.2      8575
573  2015-04-01  12158.9  320887      5.6     11.7      8549

[574 rows x 6 columns]

In [18]:
df.fillna(method='bfill')

/tmp/ipykernel_573493/2831856154.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df.fillna(method='bfill')

           date      pce     pop  psavert  uempmed  unemploy
0    1967-07-01    507.4  198712     12.5      4.5      2944
1    1967-08-01    510.5  198911     12.5      4.7      2945
2    1967-09-01    516.3  199113     11.7      4.6      2958
3    1967-10-01    512.9  199311     12.5      4.9      3143
4    1967-11-01    518.1  199498     12.5      4.7      3066
..          ...      ...     ...      ...      ...       ...
569  2014-12-01  12122.0  320201      5.0     12.6      8688
570  2015-01-01  12080.8  320367      5.5     13.4      8979
571  2015-02-01  12095.9  320534      5.7     13.1      8705
572  2015-03-01  12161.5  320707      5.2     12.2      8575
573  2015-04-01  12158.9  320887      5.6     11.7      8549

[574 rows x 6 columns]

## EDA

In [20]:
df.shape

(574, 6)

In [21]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 574 entries, 0 to 573
Data columns (total 6 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   date      574 non-null    object
 1   pce       574 non-null    float64
 2   pop       574 non-null    int64
 3   psavert   574 non-null    float64
 4   uempmed   574 non-null    float64
 5   unemploy  574 non-null    int64
dtypes: float64(3), int64(2), object(1)
memory usage: 27.0+ KB

In [22]:
df.describe()

                pce            pop     psavert     uempmed      unemploy
count    574.000000     574.000000  574.000000  574.000000    574.000000
mean    4843.510453  257189.381533    7.936585    8.610105   7771.557491
std     3579.287206   36730.801593    3.124394    4.108112   2641.960571
min      507.400000  198712.000000    1.900000    4.000000   2685.000000
25%     1582.225000  224896.000000    5.500000    6.000000   6284.000000
50%     3953.550000  253060.000000    7.700000    7.500000   7494.000000
75%     7667.325000  290290.750000   10.500000    9.100000   8691.000000
max    12161.500000  320887.000000   17.000000   25.200000  15352.000000

In [24]:
df.columns

Index(['date', 'pce', 'pop', 'psavert', 'uempmed', 'unemploy'], dtype='object')

In [25]:
df['unemploy'].value_counts()

unemploy
2856     2
10538    2
7927     2
7430     2
7375     2
        ..
10623    1
10282    1
9887     1
9499     1
11408    1
Name: count, Length: 550, dtype: int64

In [26]:
df['psavert'].unique()

array([12.5, 11.7, 12.1, 12.2, 11.6, 12. , 10.6, 10.4, 10.9, 10. ,  9.4,
        9.9,  9.5, 11.5, 11.3, 12.3, 13.3, 13.2, 13.1, 12.9, 13. , 13.4,
       14.4, 13.6, 12.8, 12.4, 12.6, 11.4, 11.8, 12.7, 14. , 13.8, 13.9,
       17. , 11.9, 11.2, 10.8,  9.8,  8.5, 10.2, 10.1, 10.5, 10.7, 11. ,
       10.3,  9.3,  9.2,  8.9,  9.6, 11.1,  9. ,  8.7,  9.1,  9.7,  8.1,
        7.5,  6.7,  8.4,  8. ,  8.6,  8.8,  6.6,  7.8,  8.2,  6.4,  7.9,
        3.8,  7. ,  6.8,  6.5,  7.6,  7.7,  7.1,  7.2,  7.4,  7.3,  8.3,
        6.3,  5.6,  5.9,  6.2,  5.8,  6.9,  6.1,  6. ,  5.5,  5. ,  5.7,
        5.4,  5.2,  5.3,  4.5,  4.3,  4.2,  4.1,  4. ,  3.5,  3.9,  3.7,
        4.7,  4.4,  4.6,  2.7,  3.4,  5.1,  4.9,  4.8,  2.9,  2.1,  3. ,
        2.2,  1.9,  2.4,  2.3,  2.6,  2.8,  3.2,  3.1,  3.3,  3.6,  2.5])

In [27]:
df['pop'].nunique()

574

# Group By Operation